Agat/src/InformationRegisters/РегистрУдаленияФайлов/РегистрУдаленияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрУдаленияФайлов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеПоле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьАрхива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

Agat/src/InformationRegisters/РегистрУдаленияФайлов/Forms/ФормаСписка/Module.bsl
// В форме списка регистра "РегистрУдаленияФайлов"

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	СтрокаРегистра = Элементы.Список.ТекущиеДанные;
	Если СтрокаРегистра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Пытаемся открыть из архива
	ПутьКФайлу = СтрокаРегистра.ПутьАрхива + "\" + СтрокаРегистра.ИмяФайла;
	
	// Пробуем открыть
	Попытка
		ЗапуститьПриложение(ПутьКФайлу);
	Исключение
		Сообщить("Не удалось открыть файл: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьФайл(Команда)
	
	СтрокаРегистра = Элементы.Список.ТекущиеДанные;
	Если СтрокаРегистра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Полный путь к файлу в архиве
	ПутьКФайлу = СтрокаРегистра.ПутьАрхива + "\" + СтрокаРегистра.ИмяФайла;
	
	// Проверяем существование файла
	Файл = Новый Файл(ПутьКФайлу);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл не найден: " + ПутьКФайлу);
		Возврат;
	КонецЕсли;
	
	// Диалог выбора места сохранения
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = СтрокаРегистра.ИмяФайла;
	Диалог.Заголовок = "Выберите папку для восстановления файла";
	
	// Вызываем диалог
	Результат = Диалог.Выбрать();
	
	// Проверяем результат
	Если Результат = Неопределено ИЛИ Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем выбранный путь
	ПутьСохранения = Диалог.ПолноеИмяФайла;
	
	Если ПустаяСтрока(ПутьСохранения) Тогда
		Возврат;
	КонецЕсли;
	
	// Копируем файл
	Попытка
		КопироватьФайл(ПутьКФайлу, ПутьСохранения);
		Сообщить("Файл успешно восстановлен в: " + ПутьСохранения);
	Исключение
		Сообщить("Ошибка восстановления файла: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры




&НаКлиенте
Процедура ОткрытьОбъектПоСсылке(Команда)
	
	СтрокаРегистра = Элементы.Список.ТекущиеДанные;
	Если СтрокаРегистра = Неопределено Или ПустаяСтрока(СтрокаРегистра.СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Вызываем серверную функцию для получения ссылки
	Ссылка = ПолучитьСсылкуПоСтрокеНаСервере(СтрокаРегистра.ИмяСправочника, СтрокаРегистра.СсылкаНаОбъект);
	
	Если Ссылка <> Неопределено Тогда
		ОткрытьЗначение(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуПоСтрокеНаСервере(ИмяСправочника, СсылкаСтрокой)
	
	Если ПустаяСтрока(СсылкаСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		// Получаем GUID из строки
		ГУИДСтрока = Прав(СсылкаСтрокой, 36);
		ГУИД = Новый УникальныйИдентификатор(ГУИДСтрока);
		
		// Находим справочник по имени
		МетаСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
		Если МетаСправочника = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получаем ссылку
		Ссылка = Справочники[МетаСправочника.Имя].ПолучитьСсылку(ГУИД);
		Возврат Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьИнформациюОФайле(Команда)
	
	СтрокаРегистра = Элементы.Список.ТекущиеДанные;
	Если СтрокаРегистра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем сообщение с информацией о файле
	ТекстСообщения = 
		"Информация об удаленном файле:" + Символы.ПС + Символы.ПС +
		"Имя файла: " + СтрокаРегистра.ИмяФайла + Символы.ПС +
		"Расширение: " + СтрокаРегистра.РасширениеФайла + Символы.ПС +
		"Дата удаления: " + Формат(СтрокаРегистра.Период, "ДФ=dd.MM.yyyy чч:мм:сс") + Символы.ПС +
		"Исходный путь: " + СтрокаРегистра.ПутьКФайлу + Символы.ПС +
		"Путь в архиве: " + СтрокаРегистра.ПутьАрхива + Символы.ПС +
		"Справочник: " + СтрокаРегистра.ИмяСправочника + Символы.ПС +
		"Элемент справочника: " + СтрокаРегистра.КлючевоеПоле + Символы.ПС +
		"Удалил: " + СтрокаРегистра.Сотрудник;
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры
